tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core", "git://mirrors.ustc.edu.cn/homebrew-core.git"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "rangaofei/saka"
tap "sass/sass"
tap "sidaf/pentest"
tap "siguremo/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# TIFF library and utilities
brew "libtiff"
# GNU database manager
brew "gdbm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# GNOME accessibility toolkit
brew "atk"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU compiler collection
brew "gcc"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Package for scientific computing with Python
brew "numpy"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Generic library support script
brew "libtool"
# Open source IA-32 (x86) PC emulator written in C++
brew "bochs"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Framework for layout and rendering of i18n text
brew "pango"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# Simple, fast and user-friendly alternative to find
brew "fd", link: false
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Powerful, lightweight programming language
brew "lua", link: false
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Network logon cracker which supports many services
brew "hydra"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Utility for directing compilation
brew "make"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# File browser
brew "ranger"
# Ruby version manager
brew "rbenv"
# Implements brute force attack to recover WPA/WPA2 passkeys
brew "reaver"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# SDK
brew "dart-lang/dart/dart"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# The origin author and page:
# https://github.com/sinpolib/sokit
# famous tool for debug with socket
#  ----by saka
brew "rangaofei/saka/sokit"
# Stylesheet Preprocessor
brew "sass/sass/sass"
brew "sidaf/pentest/crunch"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
cask "font-hack-nerd-font"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Tool for uploading images
cask "picgo"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
